Tekla Open API Reference for Tekla Structures 2025
Operation.CreateIFC4ExportFromAll Method
 Creates IFC4 export from all objects using the given file name.
See Tekla Structures Help for more information about IFC4 export files.
 Namespace: Tekla.Structures.Model.Operations
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public static bool CreateIFC4ExportFromAll(
	string fullPathAndFileName,
	Operation.IFCExportViewTypeEnum exportViewType,
	IEnumerable<string> propertySets,
	Operation.ExportBasePoint locationByValue,
	string exportLayersAsValue,
	string objectColoring,
	Operation.IFCExportFlags flags,
	string basePointGuid
)
Public Shared Function CreateIFC4ExportFromAll (
	fullPathAndFileName As String,
	exportViewType As Operation.IFCExportViewTypeEnum,
	propertySets As IEnumerable(Of String),
	locationByValue As Operation.ExportBasePoint,
	exportLayersAsValue As String,
	objectColoring As String,
	flags As Operation.IFCExportFlags,
	basePointGuid As String
) As Boolean
Parameters
fullPathAndFileName
Type: System.String
The full path and file name including extension (.ifc or .ifcZip).
exportViewType
Type: Tekla.Structures.Model.Operations.Operation.IFCExportViewTypeEnum
The export view type.
propertySets
Type: System.Collections.Generic.IEnumerable<String>
The full path and file name of the property set files (.xml) to use in export.
locationByValue
Type: Tekla.Structures.Model.Operations.Operation.ExportBasePoint
The location by value.
exportLayersAsValue
Type: System.String
The export layers as value: __Name__, __Phase__ or UDA value.
objectColoring
Type: System.String
The object coloring value: Use "ByObjectClass" for color by object class. For additional coloring, use the name of the object representation.
flags
Type: Tekla.Structures.Model.Operations.Operation.IFCExportFlags
The additional flags.
basePointGuid
Type: System.String
Base point guid, if a base point used.
Return Value
Type: Boolean
True, if Ifc4 export was successful, otherwise false. See session log for additional info in case failure.
Examples
using Tekla.Structures.Model;
using Tekla.Structures.Model.Operations;
public class Example
{
       public void Example1()
       {
           var fullPathAndFileName = @"C:\Export\MyIfc.ifc";
           var exportViewType = Operations.Operation.IFCExportViewTypeEnum.REFERENCE_VIEW;
           var propertySets = new List<string> { @"..\\default\\General\\Shared\\IFC\\AdditionalPSets\\CIP Construction data.xml" };
           var locationByValue = Operations.Operation.ExportBasePoint.GLOBAL;
           var exportLayersAsValue =  "__Name__";
           var objectColoring = "ByObjectClass";
           var flags = new Operations.Operation.IFCExportFlags { IsLocationFromOrganizer = true, IsPoursEnabled = true };
           var basePointGuid = string.Empty;
           if (Operation.CreateIFC4ExportFromAll(fullPathAndFileName, exportViewType, propertySets, locationByValue, exportLayersAsValue, objectColoring, flags, basePointGuid))
           {
                MessageBox.Show("Ifc4 export creation successful");
           }
       }
}
See Also
Reference
Operation Class
Tekla.Structures.Model.Operations Namespace